04_OpenFoam/_Tut_02/OpenFOAM-14/compressibleMultiphaseVoF/damBreak4phaseLaminar/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [pressure];

internalField   uniform 1e5;

boundaryField
{
    leftWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    rightWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    lowerWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    atmosphere
    {
        type            prghTotalPressure;
        p0              uniform 1e5;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
